# Importing packages and data

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline
sns.set()

In [3]:
df= pd.read_csv('multiTimeline.csv')

In [4]:
df.head()

                                           Category: All categories
Month   diet: (Worldwide) gym: (Worldwide)     finance: (Worldwide)
2004-01 100               31                                     47
2004-02 75                26                                     49
2004-03 71                24                                     46
2004-04 70                22                                     47

Here the above data is without skiprows, so all the rows displayed. Using skiprows=1 skips first row

In [18]:
df= pd.read_csv('multiTimeline.csv', skiprows=1)

In [19]:
df.head()

     Month  diet: (Worldwide)  gym: (Worldwide)  finance: (Worldwide)
0  2004-01                100                31                    47
1  2004-02                 75                26                    49
2  2004-03                 71                24                    46
3  2004-04                 70                22                    47
4  2004-05                 73                23                    43

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 192 entries, 0 to 191
Data columns (total 4 columns):
Month                   192 non-null object
diet: (Worldwide)       192 non-null int64
gym: (Worldwide)        192 non-null int64
finance: (Worldwide)    192 non-null int64
dtypes: int64(3), object(1)
memory usage: 6.1+ KB

# Wrangle the data

In [22]:
df.columns

Index(['Month', 'diet: (Worldwide)', 'gym: (Worldwide)',
       'finance: (Worldwide)'],
      dtype='object')

In [23]:
df.columns=['month','diet','gym','finance']
df.head()

     month  diet  gym  finance
0  2004-01   100   31       47
1  2004-02    75   26       49
2  2004-03    71   24       46
3  2004-04    70   22       47
4  2004-05    73   23       43

Earlier .info() 'month' datatype object but we need any generic data type. so convert to datetime. set_index can take multiple input for index,pass in form of array. 'inplace' is set to true to change the actual data frame

In [24]:
df.month=pd.to_datetime(df.month)
df.set_index('month',inplace=True)
df.head()

            diet  gym  finance
month
2004-01-01   100   31       47
2004-02-01    75   26       49
2004-03-01    71   24       46
2004-04-01    70   22       47
2004-05-01    73   23       43